[
   {
      id: 1,
      parkName: "Alberta Park",
      location: "NE 22nd Ave. & Killingsworth St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5651,
      longitude: -122.6444,
      waterAvailable: "No",
      size: "1.32 acres",
      description: "Alberta Park is a large shared park located in NE Portland at NE Killingsworth St. and NE 22nd Ave. The off-leash area is located at the East side of the park adjacent to 22nd (which is a fairly quiet street). The park is very shady with lots of tall pine trees, a nice reprieve for the summer heat. There are poop-bag dispensers (though they may be empty), water and conveniently located garbage cans. The park has other amenities such as tennis and basketball courts as well as restrooms."
   },
   {
      id: 2,
      parkName: "Arbor Lodge Park",
      location: "N Bryant St. & Delaware Ave.",
      typeOfPark: "Shared ",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5730,
      longitude: -122.6944,
      waterAvailable: "No",
      size: ".93 acres",
      description: "Arbor Lodge Park is a large shared park in North Portland, not too far off of I-5. The off-leash area is located in the NW corner of the park, adjacent to the tennis courts. The area is grassy and flat, with lots of trees and a couple of picnic tables. There are garbage cans, poop bags, and a water fountain nearby (works only in the summer). Like most of the shared parks, the area is not fenced and borders a road, so keep you dog under control for its own safety."
   },
   {
      id: 3,
      parkName: "Argay Park",
      location: "NE 141st Ave & Failing St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5511,
      longitude: -122.5174,
      waterAvailable: "No",
      size: "0.061 acres",
      description: "Argay Park is a medium-sized shared park located in NE Portland near Sandy Blvd. It has a rather unique distintion of being underneath a fight path so you're likely to get a close-up look at several planes flying overhead. The off-leash area is fairly small and located in the southern corner of the park along NE 141st Ave, close to a children's play area. The park is open and green with many trees. There are also plenty of garbage cans to make poop disposal convenient. It's large enough for a game of fetch but it's not fenced and borders a fairly busy street (NE 141st) so be sure your dog is under control at all times. There are no poop bags or water so come prepared."
   },
   {
      id: 4,
      parkName: "Brentwood Park",
      location: "SE 60th Ave. & Duke St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.4742,
      longitude: -122.6009,
      waterAvailable: "No",
      size: ".57 acres",
      description: "Brentwood Park in SE Portland has a modest-sized off-leash area, adjacent to the Joseph Lane School (near the soccer field/tennis courts). The area is fenced all-around, and has several trees scattered throughout the area for shade. A poop bag dispenser is on site, but bring some bags of your own just in case. There is no running water available."
   },
   {
      id: 5,
      parkName: "Brush Prairie Dog Park",
      location: "NE 149th St. & NE 101st Pl.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.7295,
      longitude: -122.5692,
      waterAvailable: "yes",
      size: "10.31 acres",
      description: "Brush Prairie Dog Park is a very large (10 acres), flat off-leash area that is completely fenced. The area is divided into two sections -- a slightly smaller section for small and/or shy dogs, and a larger section for all other dogs. There is a nice, wood-chip walking path meandering around the circumference of both sections, so you can get some exercise along with your pooch. Both sections offer plenty of room to run and play, and both have double-gated entries, water, garbage cans, and poop bags available. The park is maintained by DOGPAW."
   },
   {
      id: 6,
      parkName: "Cathedral Park",
      location: "N Edison St. & Pittsburg Ave",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5868,
      longitude: -122.7598,
      waterAvailable: "No",
      size: ".57 acres",
      description: "Cathedral Park is a shared park in the St. John's area of Portland. The off-leash area is somewhat small, but has a very unique setting. The park sits directly beneath the St. John's Bridge, and also borders the Willamette River. Between the ships passing by, and the sounds of the overhead traffic, it's quite stimulating. There are no poop bags or garbage cans near the off-leash area, but there is a water fountain. The area borders two local roads and a working railroad, so it will be necessary to keep your dog under close supervision. Cathedral Park in general is quite large, so leash up your dog and wander around this unique setting."
   },
   {
      id: 7,
      parkName: "Champoeg State Park",
      location: "8239 Champoeg Rd NE",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.2538,
      longitude: -122.9040,
      waterAvailable: "No",
      size: "6.21 acres",
      description: "Champoeg State Heritage Area has a very large and scenic off-leash area located at the west end of the park. The area is large, open, and grassy and borders a scenic woodland meadow on one side. The off-leash area is not fenced, and borders a park road on one side, so keep your dog under strict voice control. There is no running water available near the off-leash area, so come prepared. Poop bags are occasionally provided. In addition to the off-leash area, the park offers miles of running and hiking paths to enjoy with your dog on-leash."
   },
   {
      id: 8,
      parkName: "Cherry Park",
      location: "SE 110th Ave. & Stephens St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5093,
      longitude: 122.5528,
      waterAvailable: "No",
      size: "1.48 acres",
      description: "Cherry Park is a large shared park located in SE Portland, near 106th and Stephens. The park is one of the more secluded of the shared parks, and offers a nice size off-leash area in the middle of the long and slender park. The park is mostly flat with many trees scattered throughout the area. A nice feature about this off-leash area is its seclusion from nearby roads. It is bordered on two sides by fence, and it is a good distance from any roads. There are no poop bags, running water, or garbage cans on site, so come prepared."
   },
   {
      id: 9,
      parkName: "Chimney Park",
      location: "9360 N. Columbia Blvd.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.6070,
      longitude: -122.7585,
      waterAvailable: "No",
      size: "5.52 acres",
      description: "Chimney Park is a large off-leash dog park in North Portland. The park is well-maintained, with lots of room for your dog to run and many trees for shade. The park is now completely fenced, which is great since the area is adjacent to the busy Columbia Blvd. The park has no running water, but there are poop bag dispensers and garbage cans."
   },
   {
      id: 10,
      parkName: "Couch Park",
      location: "NW 19th Ave. & NW Glisan St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5267,
      longitude: -122.6913,
      waterAvailable: "No",
      size: "0.26 acres",
      description: "Couch Park is a small shared park in NW Portland. Sandwiched between Glisan and Hoyt, off of 19th Ave, the park's off-leash area is a modest size. The area is adjacent to Hoyt St. and a school playground, so keep your dog under close supervision. There is a poop bag dispenser on site, along with a water fountain and garbage cans. Note:  The area can get quite muddy in the winter."
   },
   {
      id: 11,
      parkName: "Council Crest Park",
      location: "3442 SW Council Crest Dr.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4978,
      longitude: -122.7067,
      waterAvailable: "No",
      size: "1.95 acres",
      description: "Council Crest Park is a large shared park located in the SW Hills area. The off-leash area is located on the northeast side of the circle, as you enter the park. The park offers plenty of room for your dog to run around, with lots of tall trees for shade. The park also boasts spectacular views of Mount Hood and the surrounding areas. Be careful, the off-leash area borders several roads, so have you dog under control at all times. There are no poop bags or water provided, so come prepared. In the winter, this park can be quite windy, so dress warm."
   },
   {
      id: 12,
      parkName: "Creston Park",
      location: "SE 44th Ave. & SE Powell Blvd.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4961,
      longitude: -122.6149,
      waterAvailable: "No",
      size: "0.71 acres",
      description: "Creston Park is a large shared park located in SE Portland, near Powell Blvd. and SE 44th Ave. The off-lease area is located in the center of the park, and consists mainly of a large open, circular grassy area. The area is shielded from any nearby roads, but is in close proximity to a children's playground, so keep your dog under tight control. Occasionally, poop bags are provided on site, but bring your own just in case. The off-leash area is adjacent to a nice picnic area set among tall spruce trees."
   },
   {
      id: 13,
      parkName: "Dakota Memorial Park",
      location: "NE 18th St. & NE 172nd Ave.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.6338,
      longitude: -122.4996,
      waterAvailable: "Yes",
      size: "8.01 acres",
      description: "Dakota Memorial Dog Park is a large off-leash area within Pacific Park in Vancouver. It is approximately 8 acres in size, fully fenced, with a nice mulch walking path around the perimeter. The center of the park is a large flat grassy area, great for a mondo game of fetch due to it's sheer size and openness. Water stations are provided near the entrances. It is a beautifully constructed off-leash area, with lots of trees and shade, benches."
   },
   {
      id: 14,
      parkName: "East Delta Park",
      location: "10774 N. Union Ct.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.6002,
      longitude: -122.6765,
      waterAvailable: "No",
      size: "1.81 acres",
      description: "East Delta Park is a large (5-acre), off-leash area less than a mile from West Delta Park. What distiguishes East Delta Park from its western counterpart is that the area is completely fenced on all sides and thus a better choice for dogs that tend to wander. There are some trees in the middle for shade and a couple of picnic tables, but no poop bags or water provided, so bring your own. IMPORTANT:  This park is usually closed during the winter, rainy months due to excessive flooding of much of the park."
   },
   {
      id: 15,
      parkName: "Ewing Young Dog Park",
      location: "1201 S. Blaine St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.2911,
      longitude: -122.9765,
      waterAvailable: "Yes",
      size: "1.17 acres",
      description: "The off-leash dog area at Ewing Young Park in Newberg, OR is a large, well-maintained space with dedicated sections for both large dogs and small/timid dogs. Unlike most dog parks, this park is entirely covered with wood chips/mulch, which makes for an interesting, and sometimes muddy, surface for your pooch to romp around on (but soft!). Both sections are entirely fenced, with primitive walking paths hugging the fence line for us humans. All the usual dog park staples are present -- water, double-gated entries, poop bags, garbage, and some human seating."
   },
   {
      id: 16,
      parkName: "Fernhill Park",
      location: "NE 37th Ave. & Ainsworth St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5659,
      longitude: -122.6225,
      waterAvailable: "No",
      size: "3.94 acres",
      description: "Fernhill Park is a very large and popular park with lots of trees and rolling hills. It is located in NE Portland, between Columbia Blvd. and Killingsworth. The off-leash area is large and adjacent to the NE 41st Ave side of the park. Though the park is not fenced, it's large enough to keep your dog a safe distance from the streets, which are mostly residential and not too busy. Being a large community park, it has plenty of amenities such garbage cans, restrooms, tennis courts and a play area for children. There are no poop bags so be sure to bring your own."
   },
   {
      id: 17,
      parkName: "The Fields in the Pearl",
      location: "NW 11th Ave. and NW Overton St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5326,
      longitude: -122.6823,
      waterAvailable: "Yes",
      size: "1.41 acres",
      description: ""      The Fields" in the Pearl District is an off-leash sanctuary for those city dwellars living in its vicinity. The park itself is a work in progress,
      with final completion set for sometime in mid-2010. As such,
      the off-leash area is currently designated as temporary,
      but the final park will also possess an off-leash area in some form. The current park provides a no-frills,
      flat grassy off-leash area large enough for a good game of fetch. There are some doggie play structures,
      benches for humans,
      water,
      dog bag stations,
      and nice views of the surrounding city. The park is not fenced and due to its adjacency to city streets and some nearby railroad tracks,
      keep a good eye on your pooch."
   },
   {
      id: 18,
      parkName: "Frazer Park",
      location: "NE 52nd Ave. & Hassalo St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5304,
      longitude: -122.6110,
      waterAvailable: "No",
      size: "1.81 acres",
      description: "Frazer Park is a modest-sized shared park located in NE Portland. The off-leash area is at the west end of the park and offers a large grassy area on a moderately steep hillside. The area is large enough for long game of fetch, and hosts many trees for shade in the summer. It's unfenced, like most of the shared parks, but is relatively secluded. Garbage cans and picnic tables are on site, but not running water, so come prepared. Parking is on 52nd Ave. Please keep your dog on leash from the car to the off-leash area, since the area is adjacent to a school and crosses a playground."
   },
   {
      id: 19,
      parkName: "Gabriel Park",
      location: "SW 45th Ave. and SW Vermont St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.4728,
      longitude: -122.7210,
      waterAvailable: "Yes",
      size: "1.75 acres",
      description: "Gabriel Park's 1.5 acre, off-leash area is one of the most popular in the area. The off-leash area is part of a much larger regional park with tennis courts, basketball courts and numerous trails. The park is well-maintained with poop bags, garbage cans, and running water available. The area is fenced all-around with some trees for shade, picnic tables and benches for us humans. NOTE:  In the winter, a temporary off-leash area is erected to allow for the turf in the main park to regrow. The winter area is located at the south end of the park, near the community garden."
   },
   {
      id: 20,
      parkName: "Grant Park",
      location: "NE 33rd Ave. & NE US Grant Pl.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5405,
      longitude: -122.6272,
      waterAvailable: "No",
      size: "1.02 acres",
      description: "Grant Park is a large shared park located in NE Portland near Grant High School. Due to its proximity to the high school, this park has a lot of amenities such as a track, tennis and basket ball courts, a pool and baseball diamonds. The off-leash area is large and located in the SE corner of the park. The area is popular with lots of dogs to play with and is well protected from the neighboring streets. There are benches and garbage cans but no convenient sources of water or poop bags so be sure to bring your own."
   },
   {
      id: 21,
      parkName: "Happy Valley Park",
      location: "13770 SE Ridgecrest Rd.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.4493,
      longitude: -122.5223,
      waterAvailable: "No",
      size: "0.47 acres",
      description: "Happy Valley Park has a modest-sized off-leash area located in the far end of the park (south of the parking area). The off-leash area is approximately a 1/2 acre in size, is fenced, and has poop bags and garbage cans near the entrance. The park is large enough for a decent game of fetch. There are many small trees, and a few larger trees near the edges of the park providing shaded areas. There is no water provided in the off-leash area, but there are facilities adjacent to the park where you can fill up your water jugs or bowls. The rest of the park has a stringent leash law, so keep your dogs on leash to and from the off-leash area."
   },
   {
      id: 22,
      parkName: "Hazeldale Park",
      location: "SW 192 & Farminton Rd.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.4734,
      longitude: -122.8963,
      waterAvailable: "Yes",
      size: "1.02 acres",
      description: "Hazeldale Park's off-lease area is one of the newest additions to the region, and the first dog park in Beaverton. A one-year pilot project by the Tualatin Hills Parks and Recreation District, the off-leash area was brought about by the hard work of the Washington County Dog Park group and others. The park offers a 2-acre off-leash area with separate fenced areas for small and large dogs. The park is roomy with lots of small trees scattered throughout the area. There are poop bag dispensers on site, and water is usually available. Parking is adequate."
   },
   {
      id: 23,
      parkName: "Hazelia Field Dog Park",
      location: "Stafford Rd. & Overlook Dr.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.3961,
      longitude: -122.6878,
      waterAvailable: "Yes",
      size: "1.62 acres",
      description: "The Dog Park at Hazelia Field is a beautiful off-leash area just south of Lake Oswego on Stafford Road. It replaces the original Luscher Farm Dog Park, and while not as large or rustic as its predecessor, it has all the makings of a great dog park. The park has two separate off-leash areas, one open to all dogs and one reserved for smaller and/or timid dogs. The larger main park is a little over an acre in size, with a large grassy area for fetch and a mulch walking trail around its perimeter. There are plenty of tall trees for shade, picnic tables to relax on, and covered shelters to get out of the rain (at least for the humans!). The smaller area, at about a 1/2 acre, is just as nice. It also contains a perimeter trail, a covered shelter, and several benches to relax on. Both areas have water stations, poop bags, garbage cans, and double-gated entry."
   },
   {
      id: 24,
      parkName: "Hillsdale Park",
      location: "SW 27th Ave. & Hillsdale Hwy.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4829,
      longitude: -122.7043,
      waterAvailable: "No",
      size: "2.13 acres",
      description: "Hillsdale Park is a large shared park located in SW Portland, right off of Beaverton-Hillsdale Hwy. Despite its proximity to the highway, the park is very secluded with a large off-leash area in the northwest corner of the park. The park is very scenic with lots of trees for shade in the summer. There are no poops bags or running water on site, so come prepared."
   },
   {
      id: 25,
      parkName: "Hondo Dog Park",
      location: "22800 NW Bennett St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.5526,
      longitude: -122.9098,
      waterAvailable: "Yes",
      size: "3.75 acres",
      description: "Hondo Dog Park, named after the Hillsboro Police dog who lost his life in the line of duty, is a beatifully designed and well-maintained park, and the only dedicated dog park in the city of Hillsboro. The park is a decent size, roughly 3.75 acres, and is completely fenced. There is a gravel path around the perimeter of the park with numerous benches for us humans to relax and watch are dogs romp around. Like all good dog parks, there are plenty of poop bag dispensers, garbage cans, has a double-gated entry, and a water station for those hot days. There is a beautiful memorial to Hondo in the form of an American flag painted fire hydrant. The park has a dedicated small-dog section, as well as a dedicated winter area lined with gravel (to prevent the main area from getting destroyed during the winter months). The park is open from dawn to dusk most days (opens at noon on M/Th due to maintenance)."
   },
   {
      id: 26,
      parkName: "Irving Park",
      location: "NE 7th Ave. & Fremont St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5469,
      longitude: -122.6573,
      waterAvailable: "No",
      size: "1.34 acres",
      description: "Irving Park is a large, popular shared park located in NE Portland. The park has a lot to offer with lots of trees, picnic tables, tennis and basketball courts, as well as baseball diamonds. The off-leash area is good-sized and adjacent to the NE 7th Ave. side of the park. As with many shared parks, the off-leash area is not fenced but it's a comfortable distance from the neighboring streets. There is water and garbage cans but no poop bags so bring your own."
   },
   {
      id: 27,
      parkName: "Laurelhurst Park",
      location: "SE 39th Ave. & Stark St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5210,
      longitude: -122.6262,
      waterAvailable: "No",
      size: "1.23 acres",
      description: "Laurelhurst Park is a large shared park in SE Portland, and one of the more popular ones on the east side. The off-leash area is at the southern end of the park, adjacent to the pond. The area is a large, open grassy area surrounded by large trees. There are several picnic tables in the area, and water fountains nearby. There are no poop bag dispensers on site so bring your own bags."
   },
   {
      id: 28,
      parkName: "Lents Park",
      location: "SE 92nd Ave. & Holgate Blvd.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4854,
      longitude: -122.5714,
      waterAvailable: "No",
      size: "2.12 acres",
      description: "Lents Park is a large shared park located in SE Portland, near SE 88th and Steele. The off-leash area is located in the southwest corner of the park, near the community garden. The area is a nice size, with plenty of grass and trees, and adequate parking. It is very close to nearby SE 88th Ave, so keep your dog under control. There is no water, poop bags, or garbage cans near the off-leash area, so come prepared."
   },
   {
      id: 29,
      parkName: "L.L. Stub Stewart SP",
      location: "30380 NW Hwy 47",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.7086,
      longitude: -123.1900,
      waterAvailable: "Yes",
      size: "0.41 acres",
      description: "The off-leash dog park at L.L. Stub Stewart State Park in Buxton, OR is a modest-sized area adjacent to the Hilltop Day Use Area. Due to its location on the top of a hill, the area is pitched on a steep slope, which makes for an interesting game of fetch, and will tire your pooch out faster. The area is fully fenced with double-gated entry, poop bag stations are present, and water is located a short distance from the park. The surface of the park is rather uneven at the moment, with remnant bushes scattered across the area. There are a couple of benches for us humans, appropriately angled towards the excellent views off to the west of the park. There is no dedicated small dog section."
   },
   {
      id: 30,
      parkName: "Lynchwood Park",
      location: "SE 170th Ave. & Haig St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4983,
      longitude: -122.4861,
      waterAvailable: "No",
      size: "1.18 acres",
      description: "Lynchwood Park is a beautiful shared park located in SE Portland, near 174th and Powell. The park offers a large, flat, grassy off-leash area with plenty of room for your dog to run around. The west side of the park is heavily wooded with benches and picnic tables. The park is bordered on one side by a road, but the off-leash area offers decent seclusion from nearby traffic. There are no poop bags or running water on site, so come prepared."
   },
   {
      id: 31,
      parkName: "Mary S. Young SP",
      location: "19700 Willamette Dr.",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.3807,
      longitude: -122.6292,
      waterAvailable: "Yes",
      size: "3.19 acres",
      description: "Mary S. Young State Park has a very large, off-leash area located at the end of the main park access road. The area is well-maintained, with lots of trees, picnic tables (one is sheltered), and garbage cans for your convienence. It is a relatively popular dog park with lots of regulars. Running water is available. Poop bags are sometimes available but bring your own just in case. The area is not fenced, so if your dog has a tendency to bolt then this may not be the best park for you. It's bordered on two sides by bushes and trees, and the other side by the parking area. In addition to the off-leash area, the park is host to numerous hiking trails, some leading to the Willamette river. So leash up your dog and go exploring!"
   },
   {
      id: 32,
      parkName: "Memorial Park",
      location: "8100 SW Wilsonville Rd.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.2986,
      longitude: -122.7554,
      waterAvailable: "Yes",
      size: "1.98 acres",
      description: "Memorial Park is relatively popular and for good reason. It has a large, well-maintained off-leash area with a path around the perimeter for you to get some exercise along with your dog. The area is fenced all around. There are some trees for shade in one corner, along with a few picnic tables and some water bowls (but bring your own water). Poop bags are also provided although they frequently run out, so bring your own just in case."
   },
   {
      id: 33,
      parkName: "Milo McIver State Park",
      location: "S. Springwater Rd. & S. Entrance Rd.",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.2956,
      longitude: -122.3714,
      waterAvailable: "Yes",
      size: "4.33 acres",
      description: "Milo McIver State Park is located just a few miles west of Estacada and has a beautiful off-leash area overlooking Mt. Hood. The area is very large, scenic, and well-maintained, with picnic tables, poop bags and garbage cans on site. The large area is great for a long game of fetch. There isn't much shade but running water is provided to cool down your dog. The rest of the park is just as nice, with numerous hiking trails and viewpoints leading all the way down to the river. Bring a leash and go exploring but be aware that these trails are shared by horseback riders."
   },
   {
      id: 34,
      parkName: "Molalia River State Park",
      location: "NW 37th Ave. & N. Holly St.",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.2948,
      longitude: -122.7040,
      waterAvailable: "No",
      size: "4.38 acres",
      description: "Molalla River State Park has recently moved its off-leash area, and it now has a large, flat, unfenced off-leash area that is well-maintained. The area is large enough for a nice game of fetch. There are poop bag dispensers on site, but no dedicated running water in the off-leash area (although there are some fountains near the parking area). Dress appropriately in winter, as the area has a tendency to turn into a small lake during the rainy season."
   },
   {
      id: 35,
      parkName: "Mt. Tabor Park",
      location: "SE 60th Ave. & SE Salmon St.",
      typeOfPark: "Shared",
      fenced: "Partial",
      smallDogSection: "No",
      latitude: 45.5075,
      longitude: -122.5937,
      waterAvailable: "Yes",
      size: "4.19 acres",
      description: "Mt. Tabor Park is located in SE Portland near SE 72nd and Division, and has a large off-leash area at the southern end of the park. The area is on a steep hillside adjacent to Harrison and Lincoln Streets, and offers plenty of room for your dog to run around or play fetch. The off-leash area has three fenced-entrances, but the park is not fenced in its entirety, so if your pooch has a tendency to escape, this park may not be for you. Despite the proximity to nearby streets, the area is relatively secluded from traffic. It's a heavily wooded area, so finding shade in the summer shouldn't be a problem. There is running water available and garbage cans at the three entrances. Poop bags are usually provided by other dog owners."
   },
   {
      id: 36,
      parkName: "Normandale Park",
      location: "NE 57th Ave. & Halsey St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.5313,
      longitude: -122.6056,
      waterAvailable: "Yes",
      size: "1.62 acres",
      description: "Normaldale Park's off-leash area is a large dedicated park in NE Portland. The park is large and divided into two sections, which allows for socializing dogs of different sizes and activity levels in different areas. The area is beautiful, with lots of trees for shade in the summer, and plenty of room to wander or play fetch. It is fenced all-around, so there is no worry if your dog has a tendency to bolt. Running water is accessible and poop bags are almost always available."
   },
   {
      id: 37,
      parkName: "North Clackamas Park",
      location: "5440 SE Kellogg Creek Dr.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.4265,
      longitude: -122.6078,
      waterAvailable: "Yes",
      size: "1.26 acres",
      description: "The North Clackamas Park off-leash area is a medium-sized dog park located in the northwest corner of the main park. There is running water and poop bags provided at the park, but bring your own bags just in case. There is also plenty of shade near the entrance and several picnic tables for us humans. In addition there is a path around the perimeter if you want to get some exercise. The off-leash area is completely fenced."
   },
   {
      id: 38,
      parkName: "Overlook Park",
      location: "N Fremont St. & Interstate Ave.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5482,
      longitude: -122.6828,
      waterAvailable: "No",
      size: "0.82 acres",
      description: "Overlook Park is a medium-sized shared park located in North Portland, at the intersection of N. Interstate Ave. and N. Overlook Blvd. The off-leash area is located at the South end of the park behind the picnic shelter. As the park's name implies, it has a great view of the city of Portland and the Willamette River. In addition, it has water and conveniently located garbage cans but no poop bags. The park is somewhat buffered from busy Interstate Ave. by trees and fencing but the off-leash area is open to other side streets so be sure to keep an eye on your dog."
   },
   {
      id: 39,
      parkName: "Potso Dog Park",
      location: "13200 SW Wall St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.4255,
      longitude: -122.7611,
      waterAvailable: "Yes",
      size: "1.55 acres",
      description: "POTSO dog park is one of the newer additions to Portland area dog parks. It is part of a series of exemplary dog parks established and maintained by the Tigard Dog Park Committee. The park, located in Tigard, is large and well-maintained, with running water, poop bags, garbage cans, and two sheltered picnic tables for shade. It's completely fenced and has a nice path around the perimeter. A unique feature of this park is its separate fenced-off play area for small dogs. NOTE:  During the winter, this park is only open on the weekends."
   },
   {
      id: 40,
      parkName: "Rooster Rock State Park",
      location: "Exit 25 on I-84 near Corbett",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5442,
      longitude: -122.2361,
      waterAvailable: "No",
      size: "3.62 acres",
      description: "Rooster Rock State Park has a decent off-leash area near the west end of the park. The off-leash area is simply a large open grassy area, set back off the main park road and adjacent to the marine inlet. The area is nestled among large trees, picnic tables, and some meadows. There is no running water available, nor poop bags or trash cans, so come prepared. There is a nominal fee to enter the park. This park might be worth remembering if you're planning a long trip east out of the city, and want to get your dog some last minute exercise before the long stretch on I-84. Bordering the Columbia River, the park offers much in the way of scenic hiking with your dog on leash."
   },
   {
      id: 41,
      parkName: "Ross Park",
      location: "NE Ross St. & NE 18th Ave.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.6597,
      longitude: -122.6538,
      waterAvailable: "Yes",
      size: "7.72 acres",
      description: "Ross Park is DOGPAW's flagship park (in partnership with Vancouver Parks and Recreation). This large chunk of land was generously donated by BPA (Bonneville Power Administration). The park is quite large with approximately 8 acres of rolling terrain. There are two sections to the park, a large southern section and smaller north section. The two sections are connected by a short trail, and each has an entrance to the park. There is a small dog section on the lower level near 15th Ave. The north entrance is located at 18th and Ross, and has a small gravel parking lot able to accommodate a dozen or so cars. The other parking area is located near the southwest corner of the park. Poop bag stations and garbage cans are located near the two entrances. Next to Dakota Memorial Dog Park, Ross Park is probably the largest off-leash area in the greater Portland area. Definitely worth checking out."
   },
   {
      id: 42,
      parkName: "Sacajawea Park",
      location: "NE 75th Ave. & Roselawn St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.5594,
      longitude: -122.5861,
      waterAvailable: "No",
      size: "2.68 acres",
      description: "The newly upgraded Sacajawea Park off-leash area has moved a short distance from its original location, and is now a fully-fenced dog park. There are two separate double-gated entries, and some poop bags and garbage cans, but not much else (no shade, water, or trees). The area is large, flat and great for a long game of fetch. Parking is limited near several of the adjacent streets."
   },
   {
      id: 43,
      parkName: "Sandy River Delta",
      location: "Exit 18 on I-84 near Troutdale",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5451,
      longitude: 122.3769,
      waterAvailable: "No",
      size: "1400.0 acres",
      description: "The Sandy River Delta is by far the largest of Portland's off-leash areas, and a treasure for dog owners that love to run, hike, or just wander aimlessly with their pooch. The "      Delta" comprises 1400 acres of wilderness trails,
      nestled between I-84,
      the Sandy River,
      and the Columbia River. The majority of the miles of trails within the park are officially designated as off-leash. The main exception to the off-leash rule is the parking area and the Confluence Trail,
      which runs from the parking area to the bird viewing area on the Columbia. In both of these areas you'll want to make sure your dogs are on leash because they do frequently ticket. Many of the trails lead to either the Sandy River or the Columbia River,
      so it's a great place to take your pooch to swim on summer days. The hike from the parking area to the rivers can be several miles,
      so be sure to bring along water just in case. The park is immense,
      will a plethora of wide open fields for stellar games of fetch. Bring your binoculars and camera,
      as the park is great for shutter bugs and birders. The park has recently been given a major overhaul,
      and now includes substantial parking,
      toilets,
      dog bag stations,
      and several garbage cans near the parking area. There is no running water in the park,
      so bring your own."
   },
   {
      id: 44,
      parkName: "Scappoose Dog Park",
      location: "Off of JP West Rd.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.7593,
      longitude: -122.8844,
      waterAvailable: "Yes",
      size: "1.05 acres",
      description: "The Scappoose Dog Park is a mid-sized off-leash area at the west end of Veterans Park just off JP West Rd. The area is fully-fenced with both large and small/timid dog areas. The area has access to a water spigot for your thirst pooches."
   },
   {
      id: 45,
      parkName: "Sellwood Riverfront Park",
      location: "SE Spokane St. & Oaks Pkwy.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4663,
      longitude: -122.6632,
      waterAvailable: "No",
      size: "1.69 acres",
      description: "Sellwood Riverfront Park in SE Portland is a shared park and has a modest-sized off-leash area. It is a small, but beautiful, park with nice views of the river. The off-leash section is the round grassy area in the center of the park, near the parking lot off of SE Oaks Park Way. There are no poop bags or running water on site, so come prepared. This area can get pretty muddy in the winter."
   },
   {
      id: 46,
      parkName: "Sewallcrest Park",
      location: "SE 31st Ave. & Market St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5093,
      longitude: -122.6330,
      waterAvailable: "No",
      size: "0.81 acres",
      description: "Sewallcrest Park is a shared dog park located in SE Portland, near SE 31st and Market. The off-leash area is modest in size and popular. The area is set among tall trees, which offer considerable shade in the summer heat. The area is in close proximity to 31st Ave, so keep your dog under tight control. There are no poops bags on site, so come prepared."
   },
   {
      id: 47,
      parkName: "Stevenson Dog Park",
      location: "S. 27th St. and Addy St.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.5766,
      longitude: -122.3402,
      waterAvailable: "No",
      size: "7.01 acres",
      description: "Stevenson Dog Park is a large, relatively flat off-leash area in Washougal, WA. The park has a 6 acre main section, and a 1 acre small dog/shy dog section. Both sections are completely fenced and offer double-gated entry, poop bags, garbage cans, and wood-chip walking paths. There are dog play structures scattered around the park, along with some benches for us humans. The park is large enough for a great game of fetch, but the grounds can be a tad uneven in some places. The park is maintained by DOGPAW."
   },
   {
      id: 48,
      parkName: "Summerlake Park",
      location: "11500 SW Winter Lake Dr.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.4365,
      longitude: -122.8093,
      waterAvailable: "Yes",
      size: "0.61 acres",
      description: "Summerlake Park's off-leash area is one of the 3 dog parks established and maintained by the Tigard Dog Park Committee. The park, located in Tigard's Summerlake Park, is mid-sized and well-maintained, with running water, poop bags, garbage cans, picnic tables (one sheltered) and trees for shade. It is completely fenced with the added nice feature of double-gated entry. The area can get quite muddy in the winter so come prepared."
   },
   {
      id: 49,
      parkName: "Thatcher Park",
      location: "750 NW David Hill Road",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.5387,
      longitude: -123.1357,
      waterAvailable: "Yes",
      size: "1.75 acres",
      description: "Thatcher Park in Forest Grove has a nice moderate-sized off-leash area that is fully fenced. There are separate sections for large dogs and small/timid dogs. Both areas are well-maintained with water, poop bags, and garbage cans on site. There is a nice wood chip walking path to keep your shoes mud free in the winter, and some picnic tables for us humans."
   },
   {
      id: 50,
      parkName: "Tualatin Dog Park",
      location: "8549 SW Tualatin Rd.",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: 45.3888,
      longitude: -122.7636,
      waterAvailable: "Yes",
      size: "0.61 acres",
      description: "The Tualatin Dog Park is a newly constructed off-leash area located in the north section of Tualatin Community Park. The area is comprised of both a large and small dog area, with the large area about 1/2 acre is size. Both ares are fully fenced with double-gated entries, and are entirely covered in woodchips, which should make for a relatively clean pooch come winter time. The usual amenities are provided -- water, garbage can, poop bags, picnic tables, and faux-fire hydrants. Ample parking is just a short stroll from the park."
   },
   {
      id: 51,
      parkName: "Wallace Park",
      location: "NW 25th Ave. & Raleigh St.",
      typeOfPark: "Shared",
      fenced: "Yes",
      smallDogSection: "No",
      latitude: 45.5336,
      longitude: -122.7031,
      waterAvailable: "No",
      size: "0.47 acres",
      description: "Wallace Park is a large shared park in NW Portland, at 25th and Pettygrove. The off-leash area is at the northeast corner of the park. The area is large enough for long game of fetch. There is a water fountain nearby, as well as garbage cans, but no poop bags are provided so come prepared. The area borders 25th and Raleigh, so keep an close eye on your dog."
   },
   {
      id: 52,
      parkName: "West Delta Park",
      location: "1809 N. Broadacre Rd.",
      typeOfPark: "Dedicated",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5988,
      longitude: -122.6869,
      waterAvailable: "No",
      size: "8.69 acres",
      description: "West Delta Park is a large (3-acre) open area for your dog to run around. On one side, the park is bordered by chain-linked fence, but the other 3 sides, there is only metal highway guardrails, so make sure you dog is under you control at all times. There is no water available and no poop bags, so make sure you bring your own."
   },
   {
      id: 53,
      parkName: "Willamette Park",
      location: "SW Macadam Ave. & Nebraska St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4771,
      longitude: -122.6704,
      waterAvailable: "No",
      size: "2.26 acres",
      description: "Willamette Park is a large shared park in SW Portland on the waterfront. The park offers some beautiful views of the Willamette. The designated off-leash area is the open grassy area near the north entrance to the park. The area is in close proximity to the main park road, and has several running/bike paths within it, so you'll need to keep your dog under tight control. There are no poop bags or water on site, so come prepared. * There may be a fee to park here in the summer, so check for signs where you park."
   },
   {
      id: 54,
      parkName: "Wilshire Park",
      location: "NE 33rd Ave. & Skidmore St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.5532,
      longitude: -122.6262,
      waterAvailable: "No",
      size: "1.32 acres",
      description: "Wilshire Park is a large, shared park located in NE Portland. The park has picnic tables, a childrens' play area and lots of trees. The off-leash area is large and located at the NE corner of the park next to NE 37th Ave. The area is nestled between walking paths and is set off from the side streets (which are not too busy). There are no conveniently located garbage cans, poop bags, or water so be sure to come prepared."
   },
   {
      id: 55,
      parkName: "Woodstock Park",
      location: "SE 47th Ave. & Steele St.",
      typeOfPark: "Shared",
      fenced: "No",
      smallDogSection: "No",
      latitude: 45.4840,
      longitude: -122.6133,
      waterAvailable: "No",
      size: "1.41 acres",
      description: "Woodstock Park is a large shared park located in SE Portland, near 47th and Steele. The off-leash area is a large circular area near the center of the park. There are plenty of trees for shade in the summer, and picnic tables for us humans. The park is relatively popular and you can almost always find plenty of friendly dogs here. The area can get relatively muddy in the winter. There are no poop bags or running water on site, so come prepared. Because of its proximity to nearby 47th Ave. and Steele St, keep your dog under control at all times for its own safety."
   },
   {
      id: 56,
      parkName: "Winkelman Park",
      location: "10139 SW 175th Avenue, Beaverton, OR",
      typeOfPark: "Dedicated",
      fenced: "Yes",
      smallDogSection: "Yes",
      latitude: null,
      longitude: null,
      waterAvailable: "Yes",
      size: "2 acres",
      description: "The dog park is fully fenced and partitioned into a small dog paddock, winter paddock with wood chips for use during the wet season, and a large, sloped area. The small dog paddock provides protection from larger dogs. Other amenities include an agility area for dogs with jump walls and weave poles. A paw wash and pet drinking fountain also is provided."
   }
]
